// დავაიმპორტოთ კლასი
import MyClass from "./index.js";

// მომხმარებლის მონაცემები ეიპიაისთან დასაკავშირებლად.
const credentials = {
  Email: "levan.lashauri1@gmail.com",
  Password: "Demo_1234",
};

// შექმენით კლასის ახალი ნაწილი
const myClassInstance = new MyClass(credentials);

// შეიყვანეთ ტექსტი რომელზეც უნდა დამუშავდეს
myClassInstance.text = `ოქტომბერში ისრაელის ხელისუფლებამ მწვანე პასპორტები გააუქმა მათთვის, ვინც ექვს თვეზე მეტი ხნის წინ ორჯერადად აიცრა. ახლა უკვე ეს დოკუმენტი მხოლოდ ბუსტერ დოზის შემდეგ გაიცემა. საჯარო ღონისძიებებზე დასასწრებად და სხვა თავშეყრის ადგილებში შესასვლელად „მწვანე პასპორტის“ ალტერნატივა შეიძლება იყოს მხოლოდ 24-საათიანი „მწვანე პასპორტი“, რომლის მიღებაც ანტიგენის ან ექსპრეს-ტესტის უარყოფითი პასუხის შემდეგ გაიცემა. ვაქცინაციის მოწინააღმდეგენი ცოტა არიან, მაგრამ ისინი ძალიან აქტიურობენ ვაქცინაციის მოწინააღმდეგეები, რომლებიც „მწვანე პასპორტის“ შემოღებით უკმაყოფილონი არიან, რეგულარულად უგზავნიან შეურაცხმყოფელი და ფიზიკური დაზიანების შემცველი მუქარის გზავნილებს ჯანდაცვის სამინისტროს საზოგადოებრივი ჯანდაცვის დეპარტამენტის ხელმძღვანელს შერონ ელროი-პრაისს. ამ უკანასკნელის ქმარმა ოქტომბრის ბოლოს Twitter-ზე პოლიციას მიმართა და სამართალდამცავებს მოუწოდა, რეაგირება იქონიონ "სანამ ძალიან გვიან არ იქნება". ამის შემდეგ პოლიციამ მუქარის ფაქტზე წინასწარი გამოძიება დაიწყო და ელროი-პრაისს სადღეღამისო დაცვა დაუნიშნა.`;
// myClassInstance.text =
//   "ა ბ გ დ ე ვ ზ თ ი კ ლ მ ნ ო პ ჟ რ ს ტ უ ფ ქ ღ ყ შ ჩ ც ძ წ ჭ ხ ჯ ჰ";

// გამოიტანეთ შედეგი კონსოლში
myClassInstance.onresult = function (result) {
  const MyResult = result.AudioFilePath;
  console.log(MyResult);
};

// დაიწყეთ ტექსტის დამუშავება
myClassInstance.start();
